In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# 创建对象

###  使用传递的值列表序列来创建序列, 让 pandas 创建默认整数索引

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### 使用传递的numpy数组创建数据帧,并使用日期索引和标记列:

In [4]:
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01  0.303445  0.148632  1.193971 -0.161269
2013-01-02 -0.407413  1.652793  1.845904 -0.017454
2013-01-03  0.013654  0.217275  0.968249 -0.357100
2013-01-04  0.130463  0.542344  1.515724  0.321254
2013-01-05  0.125854  0.365099  2.591579 -0.819907
2013-01-06 -0.027595  0.417365 -0.346803 -0.778046

### 使用传递的可转换序列的字典对象创建数据帧:

In [8]:
df2 = pd.DataFrame({
    'A': 1.,
    'B': pd.Timestamp('20130101'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(['test', 'train', 'test', 'train']),
    'F': 'foo'
})

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-01  1.0  3   test  foo
1  1.0 2013-01-01  1.0  3  train  foo
2  1.0 2013-01-01  1.0  3   test  foo
3  1.0 2013-01-01  1.0  3  train  foo

### 所有明确类型:

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### 输出某个子集:

In [11]:
df2.E

0     test
1    train
2     test
3    train
Name: E, dtype: category
Categories (2, object): [test, train]

# 查看数据

### 查看帧顶部和底部的行:

In [12]:
df.head()

                   A         B         C         D
2013-01-01  0.303445  0.148632  1.193971 -0.161269
2013-01-02 -0.407413  1.652793  1.845904 -0.017454
2013-01-03  0.013654  0.217275  0.968249 -0.357100
2013-01-04  0.130463  0.542344  1.515724  0.321254
2013-01-05  0.125854  0.365099  2.591579 -0.819907

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.130463  0.542344  1.515724  0.321254
2013-01-05  0.125854  0.365099  2.591579 -0.819907
2013-01-06 -0.027595  0.417365 -0.346803 -0.778046

### 显示索引, 列, 和底层的 numpy 数据:

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [16]:
df.values

array([[ 0.30344511,  0.14863158,  1.19397073, -0.16126893],
       [-0.40741279,  1.65279252,  1.84590378, -0.01745378],
       [ 0.01365417,  0.21727493,  0.96824924, -0.35710013],
       [ 0.13046281,  0.54234414,  1.51572354,  0.32125427],
       [ 0.12585394,  0.3650991 ,  2.59157873, -0.81990702],
       [-0.02759523,  0.41736481, -0.34680312, -0.77804587]])

### 描述显示数据快速统计摘要:

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.023068  0.557251  1.294770 -0.302087
std    0.240283  0.554883  0.984461  0.444320
min   -0.407413  0.148632 -0.346803 -0.819907
25%   -0.017283  0.254231  1.024680 -0.672809
50%    0.069754  0.391232  1.354847 -0.259185
75%    0.129311  0.511099  1.763359 -0.053408
max    0.303445  1.652793  2.591579  0.321254

### 转置数据:

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.303445   -0.407413    0.013654    0.130463    0.125854   -0.027595
B    0.148632    1.652793    0.217275    0.542344    0.365099    0.417365
C    1.193971    1.845904    0.968249    1.515724    2.591579   -0.346803
D   -0.161269   -0.017454   -0.357100    0.321254   -0.819907   -0.778046

### 按轴排序:

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.161269  1.193971  0.148632  0.303445
2013-01-02 -0.017454  1.845904  1.652793 -0.407413
2013-01-03 -0.357100  0.968249  0.217275  0.013654
2013-01-04  0.321254  1.515724  0.542344  0.130463
2013-01-05 -0.819907  2.591579  0.365099  0.125854
2013-01-06 -0.778046 -0.346803  0.417365 -0.027595

### 按值排序:

In [20]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  0.303445  0.148632  1.193971 -0.161269
2013-01-03  0.013654  0.217275  0.968249 -0.357100
2013-01-05  0.125854  0.365099  2.591579 -0.819907
2013-01-06 -0.027595  0.417365 -0.346803 -0.778046
2013-01-04  0.130463  0.542344  1.515724  0.321254
2013-01-02 -0.407413  1.652793  1.845904 -0.017454

In [21]:
df.sort_values(by=['C', 'B'])

                   A         B         C         D
2013-01-06 -0.027595  0.417365 -0.346803 -0.778046
2013-01-03  0.013654  0.217275  0.968249 -0.357100
2013-01-01  0.303445  0.148632  1.193971 -0.161269
2013-01-04  0.130463  0.542344  1.515724  0.321254
2013-01-02 -0.407413  1.652793  1.845904 -0.017454
2013-01-05  0.125854  0.365099  2.591579 -0.819907

# 选择器

## 读取

### 选择单列, 这会产生一个序列, 等价于 df.A:

In [22]:
df['A']

2013-01-01    0.303445
2013-01-02   -0.407413
2013-01-03    0.013654
2013-01-04    0.130463
2013-01-05    0.125854
2013-01-06   -0.027595
Freq: D, Name: A, dtype: float64

### 使用 [] 选择行的片断:

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01  0.303445  0.148632  1.193971 -0.161269
2013-01-02 -0.407413  1.652793  1.845904 -0.017454
2013-01-03  0.013654  0.217275  0.968249 -0.357100

In [24]:
df['20130102': '20130104']

                   A         B         C         D
2013-01-02 -0.407413  1.652793  1.845904 -0.017454
2013-01-03  0.013654  0.217275  0.968249 -0.357100
2013-01-04  0.130463  0.542344  1.515724  0.321254

## 使用标签选择

### 使用标签获取横截面:

In [25]:
df.loc[dates[0]]

A    0.303445
B    0.148632
C    1.193971
D   -0.161269
Name: 2013-01-01 00:00:00, dtype: float64

### 使用标签选择多轴:

In [26]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.303445  0.148632
2013-01-02 -0.407413  1.652793
2013-01-03  0.013654  0.217275
2013-01-04  0.130463  0.542344
2013-01-05  0.125854  0.365099
2013-01-06 -0.027595  0.417365

### 显示标签切片, 包含两个端点:

In [27]:
df.loc['20130102': '20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.407413  1.652793
2013-01-03  0.013654  0.217275
2013-01-04  0.130463  0.542344

### 降低返回对象维度:

In [28]:
df.loc['20130102', ['A', 'B']]

A   -0.407413
B    1.652793
Name: 2013-01-02 00:00:00, dtype: float64

### 获取标量值:

In [29]:
df.loc[dates[0], 'A']

0.30344510648220224

### 快速访问并获取标量数据(等价上面的方法):

In [30]:
df.at[dates[0], 'A']

0.30344510648220224

## 按位置选择

### 传递整数选择位置

In [31]:
df.iloc[3]

A    0.130463
B    0.542344
C    1.515724
D    0.321254
Name: 2013-01-04 00:00:00, dtype: float64

### 使用整数片断, 效果类似 numpy/python:

In [32]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.130463  0.542344
2013-01-05  0.125854  0.365099

### 使用整数偏移定位列表, 效果类似 numpy/python 样式:

In [33]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.407413  1.845904
2013-01-03  0.013654  0.968249
2013-01-05  0.125854  2.591579

### 显示行切片:

In [34]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.407413  1.652793  1.845904 -0.017454
2013-01-03  0.013654  0.217275  0.968249 -0.357100

### 显示列切片:

In [35]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.148632  1.193971
2013-01-02  1.652793  1.845904
2013-01-03  0.217275  0.968249
2013-01-04  0.542344  1.515724
2013-01-05  0.365099  2.591579
2013-01-06  0.417365 -0.346803

### 显式获取一个值:

In [36]:
df.iloc[1, 1]

1.6527925150413465

### 快速访问一个标量(等同上个方法):

In [37]:
df.iat[1, 1]

1.6527925150413465

# 布尔索引

### 使用单个列的值选择数据:

In [38]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.303445  0.148632  1.193971 -0.161269
2013-01-03  0.013654  0.217275  0.968249 -0.357100
2013-01-04  0.130463  0.542344  1.515724  0.321254
2013-01-05  0.125854  0.365099  2.591579 -0.819907

### where 操作:

In [39]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.303445  0.148632  1.193971       NaN
2013-01-02       NaN  1.652793  1.845904       NaN
2013-01-03  0.013654  0.217275  0.968249       NaN
2013-01-04  0.130463  0.542344  1.515724  0.321254
2013-01-05  0.125854  0.365099  2.591579       NaN
2013-01-06       NaN  0.417365       NaN       NaN

### 使用 isin() 筛选:

In [40]:
df2 = df.copy()

In [41]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [42]:
df2

                   A         B         C         D      E
2013-01-01  0.303445  0.148632  1.193971 -0.161269    one
2013-01-02 -0.407413  1.652793  1.845904 -0.017454    one
2013-01-03  0.013654  0.217275  0.968249 -0.357100    two
2013-01-04  0.130463  0.542344  1.515724  0.321254  three
2013-01-05  0.125854  0.365099  2.591579 -0.819907   four
2013-01-06 -0.027595  0.417365 -0.346803 -0.778046  three

In [43]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.013654  0.217275  0.968249 -0.357100   two
2013-01-05  0.125854  0.365099  2.591579 -0.819907  four

# 赋值

### 赋值一个新列, 通过索引自动对齐数据:

In [44]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [45]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [46]:
df['F'] = s1

In [47]:
df

                   A         B         C         D    F
2013-01-01  0.303445  0.148632  1.193971 -0.161269  NaN
2013-01-02 -0.407413  1.652793  1.845904 -0.017454  1.0
2013-01-03  0.013654  0.217275  0.968249 -0.357100  2.0
2013-01-04  0.130463  0.542344  1.515724  0.321254  3.0
2013-01-05  0.125854  0.365099  2.591579 -0.819907  4.0
2013-01-06 -0.027595  0.417365 -0.346803 -0.778046  5.0

### 按标签赋值:

In [48]:
df.at[dates[0], 'A'] = 0

In [49]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.148632  1.193971 -0.161269  NaN
2013-01-02 -0.407413  1.652793  1.845904 -0.017454  1.0
2013-01-03  0.013654  0.217275  0.968249 -0.357100  2.0
2013-01-04  0.130463  0.542344  1.515724  0.321254  3.0
2013-01-05  0.125854  0.365099  2.591579 -0.819907  4.0
2013-01-06 -0.027595  0.417365 -0.346803 -0.778046  5.0

### 按位置赋值:

In [50]:
df.iat[0, 1] = 0

In [51]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  1.193971 -0.161269  NaN
2013-01-02 -0.407413  1.652793  1.845904 -0.017454  1.0
2013-01-03  0.013654  0.217275  0.968249 -0.357100  2.0
2013-01-04  0.130463  0.542344  1.515724  0.321254  3.0
2013-01-05  0.125854  0.365099  2.591579 -0.819907  4.0
2013-01-06 -0.027595  0.417365 -0.346803 -0.778046  5.0

### 通过 numpy 数组分配赋值:

In [52]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [53]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.193971  5  NaN
2013-01-02 -0.407413  1.652793  1.845904  5  1.0
2013-01-03  0.013654  0.217275  0.968249  5  2.0
2013-01-04  0.130463  0.542344  1.515724  5  3.0
2013-01-05  0.125854  0.365099  2.591579  5  4.0
2013-01-06 -0.027595  0.417365 -0.346803  5  5.0

### where 操作赋值:

In [54]:
df2 = df.copy()

In [55]:
df2[df2 > 0] = -df2

In [56]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.193971 -5  NaN
2013-01-02 -0.407413 -1.652793 -1.845904 -5 -1.0
2013-01-03 -0.013654 -0.217275 -0.968249 -5 -2.0
2013-01-04 -0.130463 -0.542344 -1.515724 -5 -3.0
2013-01-05 -0.125854 -0.365099 -2.591579 -5 -4.0
2013-01-06 -0.027595 -0.417365 -0.346803 -5 -5.0

# 丢失的数据

pandas 主要使用 np.nan 替换丢失的数据. 默认情况下它并不包含在计算中.

### 重建索引允许 更改/添加/删除 指定指定轴索引, 并返回数据副本:

In [57]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [58]:
df1.loc[dates[0]: dates[1], 'E'] = 1

In [59]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.193971  5  NaN  1.0
2013-01-02 -0.407413  1.652793  1.845904  5  1.0  1.0
2013-01-03  0.013654  0.217275  0.968249  5  2.0  NaN
2013-01-04  0.130463  0.542344  1.515724  5  3.0  NaN

### 删除任何有丢失数据的行:

In [60]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.407413  1.652793  1.845904  5  1.0  1.0

### 填充丢失数据:

In [61]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.193971  5  5.0  1.0
2013-01-02 -0.407413  1.652793  1.845904  5  1.0  1.0
2013-01-03  0.013654  0.217275  0.968249  5  2.0  5.0
2013-01-04  0.130463  0.542344  1.515724  5  3.0  5.0

### 获取值是否为 nana 的布尔标记:

In [62]:
 pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# 运算

## 统计
计算时一般不包括丢失的数据

### 在 index 轴上计算均值:

In [63]:
df.mean()  # axis参数默认为0, 表示 index 轴

A   -0.027506
B    0.532479
C    1.294770
D    5.000000
F    3.000000
dtype: float64

### 在 column 轴上计算均值:

In [64]:
df.mean(axis=1)

2013-01-01    1.548493
2013-01-02    1.818257
2013-01-03    1.639836
2013-01-04    2.037706
2013-01-05    2.416506
2013-01-06    2.008593
Freq: D, dtype: float64

### 用于运算的对象有不同维度并需要对齐. 除此之外, pandas 会自动沿着指定维度计算:

In [65]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [66]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [67]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.193971  5  NaN
2013-01-02 -0.407413  1.652793  1.845904  5  1.0
2013-01-03  0.013654  0.217275  0.968249  5  2.0
2013-01-04  0.130463  0.542344  1.515724  5  3.0
2013-01-05  0.125854  0.365099  2.591579  5  4.0
2013-01-06 -0.027595  0.417365 -0.346803  5  5.0

In [68]:
df.sub(s, axis=0)

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.986346 -0.782725 -0.031751  4.0  1.0
2013-01-04 -2.869537 -2.457656 -1.484276  2.0  0.0
2013-01-05 -4.874146 -4.634901 -2.408421  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

## Apply

### 在数据上使用函数:

In [69]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  1.193971   5   NaN
2013-01-02 -0.407413  1.652793  3.039875  10   1.0
2013-01-03 -0.393759  1.870067  4.008124  15   3.0
2013-01-04 -0.263296  2.412412  5.523847  20   6.0
2013-01-05 -0.137442  2.777511  8.115426  25  10.0
2013-01-06 -0.165037  3.194875  7.768623  30  15.0

In [70]:
df.apply(lambda x: x.max() - x.min())

A    0.537876
B    1.652793
C    2.938382
D    0.000000
F    4.000000
dtype: float64

## 直方图

In [71]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [72]:
s

0    2
1    6
2    0
3    6
4    1
5    3
6    3
7    6
8    2
9    5
dtype: int64

In [73]:
s.value_counts()

6    3
3    2
2    2
5    1
1    1
0    1
dtype: int64

## 字符串方法

### 序列可以使用一些字符串处理方法, 很轻易操作数据组中的每个元素, 比如以下代码片断.
### 注意: 字符匹配方法默认情况下, 通常使用正则表达式(并且大多数时候都如此).

In [74]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [75]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# 合并

pandas 提供各种工具以简便合并序列, 数据帧, 和组合对象. 在 连接/合并 类型操作中, 使用多种类型索引和相关数学函数.

### 把 pandas 对象连接到一起:

In [76]:
df = pd.DataFrame(np.random.randn(10, 4))

In [77]:
df

          0         1         2         3
0 -0.700228 -0.989264 -1.422863  0.132806
1 -0.281164 -0.843703  1.481847  1.234192
2 -0.897548  0.048507 -0.577723  0.355044
3 -0.005357  0.533747  0.960060 -1.230256
4  1.518772  0.453164 -2.355260  1.068350
5 -1.911623 -1.619787 -1.861331 -0.868517
6 -0.510178  0.766487  1.136092  1.118555
7 -0.482657  0.330215 -1.649208  0.127814
8 -1.256083 -0.000541 -1.534834  1.784271
9  0.037076 -0.548890  0.366764  0.193158

In [78]:
pieces = [df[:3], df[3:7], df[7:]]

In [79]:
pieces

[          0         1         2         3
 0 -0.700228 -0.989264 -1.422863  0.132806
 1 -0.281164 -0.843703  1.481847  1.234192
 2 -0.897548  0.048507 -0.577723  0.355044,
           0         1         2         3
 3 -0.005357  0.533747  0.960060 -1.230256
 4  1.518772  0.453164 -2.355260  1.068350
 5 -1.911623 -1.619787 -1.861331 -0.868517
 6 -0.510178  0.766487  1.136092  1.118555,
           0         1         2         3
 7 -0.482657  0.330215 -1.649208  0.127814
 8 -1.256083 -0.000541 -1.534834  1.784271
 9  0.037076 -0.548890  0.366764  0.193158]

In [80]:
pd.concat(pieces)

          0         1         2         3
0 -0.700228 -0.989264 -1.422863  0.132806
1 -0.281164 -0.843703  1.481847  1.234192
2 -0.897548  0.048507 -0.577723  0.355044
3 -0.005357  0.533747  0.960060 -1.230256
4  1.518772  0.453164 -2.355260  1.068350
5 -1.911623 -1.619787 -1.861331 -0.868517
6 -0.510178  0.766487  1.136092  1.118555
7 -0.482657  0.330215 -1.649208  0.127814
8 -1.256083 -0.000541 -1.534834  1.784271
9  0.037076 -0.548890  0.366764  0.193158

## 连接

### SQL 样式合并:

In [95]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [96]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [97]:
left

   key  lval
0  foo     1
1  foo     2

In [98]:
right

   key  rval
0  foo     4
1  foo     5

In [99]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

## 添加

### 添加行到数据帧:

In [114]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

In [115]:
df

          A         B         C         D
0  1.216934 -0.998300 -0.249270 -1.457175
1  0.127124 -0.791171 -0.779554 -0.454587
2 -0.821124  1.416193  0.154765 -0.079214
3 -1.102312 -0.113441  1.307949 -1.036031
4 -0.737928 -0.612552  2.070752  0.732692
5  0.679285  0.606329 -0.631818  0.859778
6  0.346099  2.441145  0.452065  0.529263
7 -1.591993  0.677522 -0.004732 -2.101690

In [116]:
s = df.iloc[3]

In [117]:
df.append(s, ignore_index=True)

          A         B         C         D
0  1.216934 -0.998300 -0.249270 -1.457175
1  0.127124 -0.791171 -0.779554 -0.454587
2 -0.821124  1.416193  0.154765 -0.079214
3 -1.102312 -0.113441  1.307949 -1.036031
4 -0.737928 -0.612552  2.070752  0.732692
5  0.679285  0.606329 -0.631818  0.859778
6  0.346099  2.441145  0.452065  0.529263
7 -1.591993  0.677522 -0.004732 -2.101690
8 -1.102312 -0.113441  1.307949 -1.036031

# 分组

对于 "group by" 指的是以下一个或多个处理:
- 将数据按某些标准分割为不同的组
- 在每个独立组上应用函数
- 组合结果为一个数据结构

In [118]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'bar'],
                   'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})

In [119]:
df

     A      B         C         D
0  foo    one  2.289670  0.634636
1  bar    one  0.051183 -0.001081
2  foo    two -0.924862  0.393375
3  bar  three  0.171768 -0.480921
4  foo    two  1.696475  1.306369
5  bar    two  0.553815  1.365208
6  foo    one -0.415240  0.471782
7  bar  three  0.027974 -1.022983

### 分组, 然后应用函数统计总和, 存放到结果组:

In [126]:
df.groupby('A').sum()

            C         D
A
bar  0.804740 -0.139777
foo  2.646043  2.806163

### 按多列分组为层次索引, 然后应用函数:

In [128]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.051183 -0.001081
    three  0.199742 -1.503905
    two    0.553815  1.365208
foo one    1.874430  1.106419
    two    0.771613  1.699744

# 重塑

## 堆叠

In [129]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [130]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'seconds'])

In [132]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [133]:
df

                      A         B
first seconds
bar   one     -0.521887  0.000411
      two     -0.095091  1.768762
baz   one     -0.118690  1.275215
      two     -1.421768 -0.666990
foo   one     -0.318753  1.212759
      two      1.883025 -0.413191
qux   one      1.435803  0.781686
      two      0.398511 -0.750113

In [134]:
df2 = df[:4]

In [135]:
df2

                      A         B
first seconds
bar   one     -0.521887  0.000411
      two     -0.095091  1.768762
baz   one     -0.118690  1.275215
      two     -1.421768 -0.666990

### 堆叠函数, "压缩" 数据帧的列一个级别:

In [136]:
stacked = df2.stack()

In [137]:
stacked

first  seconds
bar    one      A   -0.521887
                B    0.000411
       two      A   -0.095091
                B    1.768762
baz    one      A   -0.118690
                B    1.275215
       two      A   -1.421768
                B   -0.666990
dtype: float64

### 被 "堆叠" 数据帧或序列(有多个索引作为索引), 其堆叠的反向操作为取消堆叠, 上面的数据默认反堆叠到上一级别:

In [142]:
stacked.unstack()

                      A         B
first seconds
bar   one     -0.521887  0.000411
      two     -0.095091  1.768762
baz   one     -0.118690  1.275215
      two     -1.421768 -0.666990

In [144]:
stacked.unstack(level=1)

seconds       one       two
first
bar   A -0.521887 -0.095091
      B  0.000411  1.768762
baz   A -0.118690 -1.421768
      B  1.275215 -0.666990

In [145]:
stacked.unstack(level=0)

first           bar       baz
seconds
one     A -0.521887 -0.118690
        B  0.000411  1.275215
two     A -0.095091 -1.421768
        B  1.768762 -0.666990

## 数据透视表

### 查看数据透视表

In [148]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})

In [149]:
df

        A  B    C         D         E
0     one  A  foo -0.735375  1.136729
1     one  B  foo -0.363280  0.987890
2     two  C  foo -0.721741  2.178620
3   three  A  bar -0.307035 -0.432990
4     one  B  bar  0.727936  0.734379
5     one  C  bar -0.197410  0.294926
6     two  A  foo  0.343230  1.640823
7   three  B  foo  1.170650  0.202966
8     one  C  foo -0.060179 -1.219254
9     one  A  bar  1.001632 -2.365476
10    two  B  bar  1.262148 -0.835107
11  three  C  bar  0.311623  0.468184

### 我们可以从上面的数据中, 非常容易的产生数据透视表:

In [150]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  1.001632 -0.735375
      B  0.727936 -0.363280
      C -0.197410 -0.060179
three A -0.307035       NaN
      B       NaN  1.170650
      C  0.311623       NaN
two   A       NaN  0.343230
      B  1.262148       NaN
      C       NaN -0.721741